---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.AreaLoadNoForce
source: html/8df31f64-797d-84d7-8247-456772f58226.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.AreaLoadNoForce Property

Area Load can't have all force components equal to zero.

## Syntax (C#)
```csharp
public static FailureDefinitionId AreaLoadNoForce { get; }
```